<?php

return [
    'title' => 'Σχετικά με το greekparliament.info',
    'p1' => 'Η σελίδα greekparliament.info αποτελεί τη προσπάθεια να δημιουργίας μιας πλατφόρμας με σκοπό την ευκολότερη πρόσβαση στα πρακτικά της Βουλής των Ελλήνων.',
    'p2' => 'Τα κείμενα που παρουσιάζοντε στη πλατφόρμα προέρχονται απο τα επίσημα πρακτικά της ιστοσελίδας hellenicparliament.gr.',
    'p3' => 'Η σελίδα επεκτίνεται συνέχεια και νέες λειτουργίες προστίθονται όσο περνάει ο χρόνος βέβαια όμως με κάποια σχετική καθυστέριση.',
    'p4' => 'Είναι πολύ πιθανό να συναντίσετε λάθοι στα κείμενα, μιας και η διαδικασία ταυτοποίησης των ομιλητών δεν μπορεί να έχει 100% επιτυχία λόγο ατελειών του λογισμικού ταυτοποίησης. Σε περίπτωση που εντοπίσεται κάποιο σφάλμα σας παρακαλούμε να το αναφέρετε για να το διορθώσουμε.',
    'p5' => 'Για τυχόν ερωτήσεις και απορείες επικοινωνήστε μαζί μας.'
];