<?php

return [
    'search' => 'Αναζήτηση',
    'no_conferences_available' => 'Δεν υπάρχουν διαθέσιμες συνεδριάσεις',
    'conference'  => [
        'show_chart' => 'Εμφάνιση γραφήματος',
        'hide_chart' => 'Κλείσιμο γραφήματος',
        'conference' => 'Συνεδρίαση',
        'pdf' => 'Πρωτότυπο pdf',
        'word' => 'Πρωτότυπο word',
        'data_alert' => 'Στα δεδομένα ενδέχεται να υπάρχουν αποκλείσεις λόγο της αυτόματης εξαγωγής τους απο το λογισμικό αναγνώρισης προτύπων που χρησιμοποιείται στο πρωτότυπο κείμενο.',
        'no_speeches_avail' => 'Δεν υπάρχουν διαθέσιμες ομιλίες'
    ],
    'datepicker'  => [
        'select_date_ranges' => 'Επιλέξτε ένα εύρος ημερομηνιών ή μια συγκεκριμένη ημερομηνία',
        'from' => 'Από',
        'to' => 'Έως',
        'from_to'  => 'Από έως',
        'date' => 'Ημερομηνία',
        'select_single_date' => 'Επιλέξτε ημερομηνία',
        'submit' => 'Καταχώριση'
    ],
];