<?php

return [
    'register' => 'Εγγραφή',
    'name' => 'Όνομα',
    'email' => 'Email',
    'not_valid_mail' => 'Το email δεν είναι έγκυρο',
    'password' => 'Κωδικός',
    'pass_least' => 'Ο κωδικός πρέπει να έχει τουλάχιστον',
    'letters' => 'γράμματα.',
    'least_one_number' => 'Ο κωδικός πρέπει να έχει τουλάχιστον έναν αριθμό.',
    'least_one_uppercase' => 'Ο κωδικός πρέπει να έχει τουλάχιστον ένα κεφαλαίο γράμμα.',
    'least_one_lowercase' => 'Ο κωδικός πρέπει να έχει τουλάχιστον ένα μικρό γράμμα.',
    'confirm_pass' => 'Επιβεβαίωση κωδικού',
    'identical_pass' => 'Οι κωδικοί πρόσβασης πρέπει να είναι ίδιοι.',
    'fields_with' => 'Τα πεδία με ',
    'required' => 'είναι υποχρεωτικά',
    'cap_and_lowercase' => 'Ο κωδικός πρέπει να περιέχει τουλάχιστον 1 κεφαλαίο και μικρό γράμμα.'
];