<?php

return [
    'keywords' => 'Λέξεις κλειδιά',
    'keywords_info' => 'Εισάγετε μια ή περισσοτερες λέξεις κλειδιά. (π.χ. Μνημόνιο, Μακεδονικό, Κόκκινα δάνεια κτλ).',
    'speakers' => 'Ομιλητές',
    'one_or_more_speakers' => 'Επιλέξτε ένα ή περισσότερους ομιλητές.',
    'political_parties' => 'Πολιτικές παρατάξεις',
    'one_or_more_parties' => 'Επιλέξτε μια ή περισσότερες πολιτικές παρατάξεις.',
    'date' => 'Ημερομηνία',
    'distinct_date' => 'Συγκεριμένη ημερομηνία',
    'range_date' => 'Έυρος ημερομηνιών',
    'reset_info' => 'Η Επαναφορά καθαρίζει το πεδίο στο οποίο εισάγατε την ημερομηνία.',
    'reset_btn' => 'Επαναφορά',
    'filters' => 'Φίλτρα',
    'clear_filters' => 'Καθαριστμός φίλτρων'
];