<template>
    <div class="container">
        <div class="about-container p-3">
            <!-- <h3 class="pb-2"><b>{{ $t("about.title") }}</b></h3>
            <p class="pl-4">{{ $t("about.p1") }}</p>
            <p class="pl-4">{{ $t("about.p2") }}</p>
            <p class="pl-4">{{ $t("about.p3") }}</p>
            <p class="pl-4">{{ $t("about.p4") }}</p>
            <p class="pl-4">{{ $t("about.p5") }}</p> -->
            
            <div class="col-12">
                <h3>Τι είναι το www.greekparliament.info;</h3>
                <p class="pl-4">Το www.greekparliament.info είναι μια απόπειρα εξόρυξης δεδομένων από τα πρακτικά της Ελληνικής Βουλής και παρουσίασης τους με εμφανίσιμο τροπο. Προς το παρόν, η σελίδα είναι σε δοκιμαστική έκδοση.</p>
            </div>
            <div class="col-12">
                <h3>Τι είδους δεδομένα υπάρχουν;</h3>

                <p class="pl-4">Οι συνεδριάσεις που βρίσκονται στην επίσημη σελίδα της Βουλής (www.hellenicparliament.gr) με τις ομιλίες χωρισμένες ανα βουλευτή. Αυτή τη στιγμή διαθέτουμε όλες τις ομιλίες απο το 1989 μέχρι σήμερα. Δεδομένα σχετικά με τον κάθε βουλευτή (κοινοβουλευτική πορεία). Δεδομένα σχετικά με τα κόμματα η κοινοβουλευτικές ομάδες.
                Παρόλα αυτά για τον λόγο χαμηλού κόστους του server που διαθέτουμε, στη σελίδα μας παρουσιάζουμε ομιλίες απο το διάστημα '2010-01-11' έως σήμερα, οταν καταφέρουμε να αποκτήσουμε ενα server με μεγαλύτερο χώρο για τη βάση δεδομένων θα εισάγουμε όλο τον όγκο των δεδομένων.</p>
            </div>
            <div class="col-12">
                <h3>Πώς αναπτύχθηκε το project;</h3>

                <p class="pl-4">Για την εξόρυξη των δεδομένων (scraping και parsing) χρησιμοποιούμε τη γλώσσα προγραμματισμού python. Η σελίδα είναι ανεπτυγμένη σε PHP/Laravel/Vue.js. Η βάση δεδομένων που χρησιμοποιείται είναι η MySQL, με πλάνο στο μέλλον να χρησιμοποιήσουμε ElasticSearch για τις λειτουργίες fulltext αναζήτησης.</p>
            </div>
            <div class="col-12">
                <h3>Κάποια κομμάτια της σελίδας δεν δουλεύουν σωστά/Κάποιες ομιλίες ή συνεδριάσεις δεν είναι διαθέσιμες/Οι αναζητήσεις είναι πάρα πολύ αργές</h3>

                <p class="pl-4">Η σελίδα είναι ακόμα υπο κατασκευή και δυστυχώς τα προβλήματα δε μπορούν να λυθούν πολύ γρήγορα. Το κύριο πρόβλημα είναι οτι ο server μας είναι πολύ μικρός για τον όγκο των δεδομένων που παράγουμε και επεξεργαζόμαστε. Με τη μεταφορά μας στο μέλλον σε μεγαλύτερο server και πιο ανεπτυγμένες τεχνολογίες θα έχουμε τη δυνατότητα να παρέχουμε καλύτερες υπηρεσίες . Παρ' όλ' αυτά, κάθε feedback σχετικά με τις δυσκολίες που έχετε στη χρήση της σελίδας είναι ευπρόσδεκτη.</p>
            </div>
            <div class="col-12">
                <h3>Ποιά είναι τα μελλοντικά στοιχέια που θέλετε να προσθέσετε;</h3>
                <ul class="pl-4">
                    <li>Λίνκ σε βίντεο απο κάθε συνεδρίαση.
                    <li>Παραπάνω στοιχεία για κάθε ομιλιτη (Πρόεδρος συνεδρίασης, Υπουργός κλπ).</li>
                    <li>Παραπάνω στοιχεία για κάθε ομιλία (Επερώτηση, Κατάθεση αναφορών).</li>
                    <li>Συγκεντρωμένα στατιστικά ομιλιών για κάθε συνεδρίαση ή κοινοβουλευτική περίοδο ανα βουλευτή/κόμμα. Πρακτικά απο άλλες συνεδριάσεις (πχ δημοτικά συμβούλια, άλλες κοινοβουλευτικές επιτροπές).</li>
                    <li>Δυνατότητα παρακολούθησεις λέξεων που αναφέρονται στο κείμενο και ενημέρωση χρήστη μέσω email ή της εφαρμογής.</li>
                    <li>Αναζήτηση ομιλιτών βάση νομού που εκπροσοπούν.</li>
                    <li>Προτείνετε κάποια λειτουργεία και εσείς επικοινωνήστε μαζί μας!</li>
                </ul>
            </div>
            <div class="col-12">
                <h3>Θελω να ασχοληθω κι εγώ με το project. Πως μπορώ;</h3>
                <ul class="pl-4">
                    <li>Το πρόγραμμα είναι ακόμα σε εμβρυακό στάδιο και αναπτύσσεται απο 3 άτομα (οι οποίοι έχουμε αναλάβει και όλα τα έξοδα), οπότε κάθε βοήθεια είναι χρήσιμη. Χρειάζεται βοήθεια στα εξής:</li>
                    <li>Αναφορά bugs. Testing των αρχείων και έυρεση λαθών. Έρευνα για παραπάνω στοιχεία βουλευτών και χειροκίνητη προσθήκη των δεδομένων.</li>
                </ul>
                <p class="pl-4">Αν είστε developer η Data Scientist, κάθε βοήθεια/ιδέα είναι ευπρόσδεκτη. Το ίδιο και αν έχετε κάποιον γρήγορο και αξιόποστο διαθέσιμο server να προσφέρετε. Παρακαλω επικοινωνήστε μαζί μας.</p>
                <p class="pl-4">Στην πραγματικότητα όμως η σημαντικότερη βοήθεια που μπορείτε να προσφέρετε είναι η διάδοση της σελίδας μας. Δεν διαφημιζόμαστε οπότε βασιζόμαστε στο word of mouth και την καλή φήμη.</p>
            </div>
            <div class="col-12">
                <h3>Μπορω να εχω τα δεδομένα σε raw form;</h3>
                <p class="pl-4">Πιθανότατα ναι. Επικοινωνήστε μαζί μας στο email <a href="mailto:info@greekparliament.info" title="Email us">info@greekparliament.info</a>.</p>
            </div>
            </div>
        </div>
    </div>
</template>
<style lang="scss" scoped>
    $containerColor: white;
    .about-container {
        background-color: $containerColor;
        border-radius: 5px;
        margin-top: 5px;
        margin-bottom: 5px;
    }
</style>
<script>
export default {

}
</script>